package com.canyuns.cycle;

public final class routeStrings {

    public static final String[] routeAddress = {
            "杭州市闻涛路",
            "杭州市钱塘路",
            "杭州市龙井路",
            "杭州市梅灵南路",
            "杭州市西溪湿地",
            "杭州市茅家埠",
            "杭州市之江路",
            "杭州市湘湖路",
            "杭州市漕雅线",
            "杭州市长径线",

            "绍兴市解放大道",
            "绍兴市樊拈线",
            "绍兴市天竺浄寺",
            "绍兴市曹娥江",
            "绍兴市枫谷线",
            "绍兴市平王线",
            "绍兴市十赵线",

            "宁波市白云岗",
            "宁波市箭峰",
            "宁波市东钱湖",
            "宁波市韩天线",
            "宁波市袁毛线",
            "宁波市细北线",
            "宁波市石碶"
    };

    public static final String[] TITLES =
            {"闻涛路路线",
                    "钱塘路绿道路线",
                    "龙井爬坡路线",
                    "梅灵路爬坡路线",
                    "西溪湿地骑行路线",
                    "茅家埠越野路线",
                    "钱塘江北岸绿道",
                    "湘湖休闲骑路线",
                    "径山四岭水库骑行路线",
                    "径山骑行路线"
            };

    public static final String[] TITLES_sx =
            {"镜湖环线",
                    "五峰岭",
                    "嵊州天竺爬坡路线",
                    "上虞曹娥江路线",
                    "诸暨枫谷线",
                    "王平线",
                    "十赵线"
            };

    public static final String[] TITLES_nb =
            {"横溪—白云岗—塘溪",
                    "上箭峰长坡",
                    "东钱湖环湖路线",
                    "高钱---十里四香--三溪浦水库--天童",
                    "上陈--芝林—上陈路线",
                    "四明山路线",
                    "石碶--四明山镇--大岚--细岭--石碶"
            };

    public static final int[] ICONS =
            {
                    R.drawable.wentaolu,
                    R.drawable.qiantanglu,
                    R.drawable.icon_lj,
                    R.drawable.meilinglu,
                    R.drawable.xixishidi,
                    R.drawable.maojiabu,
                    R.drawable.qiantangjiangbeian,
                    R.drawable.xianghu,
                    R.drawable.jingshansiling,
                    R.drawable.icon_js
            };

    public static final int[] ICONS_sx =
            {
                    R.drawable.jinghu,
                    R.drawable.wufengling,
                    R.drawable.shengzhoutianzhu,
                    R.drawable.shangyucaoejiang,
                    R.drawable.fengguxian,
                    R.drawable.wangpingxian,
                    R.drawable.shizhaoxian
            };

    public static final int[] ICONS_nb =
            {
                    R.drawable.hengxi,
                    R.drawable.shangjianfeng,
                    R.drawable.dongqianhu,
                    R.drawable.gaoqian,
                    R.drawable.shangchen,
                    R.drawable.simingshan,
                    R.drawable.shiqi
            };

    public static final String[] routeDetail =
            {
                    "<html><head></head><body>"
                            + "<h1>闻涛路路线</h1>"
                            + "<p>从钱江龙雕塑往上游可以一直骑行至之江大桥，大约13公里左右，这一段已经是杭州的“三江两岸”绿道。</p>"
                            +"<img src=\"" + R.raw.route_1 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>钱塘路绿道路线</h1>"
                            + "<p>之江路和之浦路路口附近的钱塘路开始，在钱塘江南岸的绿道，一直延伸到富阳的新沙岛码头，大约20公里。</p>"
                            +"<img src=\"" + R.raw.route_2 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>龙井爬坡路线</h1>"
                            + "<p>此条路线离杭州市中心较近，为杭州市区骑友的日常锻炼路线。龙井爬坡分南坡和北坡，北坡2.5公里，南坡2.3公里左右。</p>"
                            +"<img src=\"" + R.raw.route_3 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>梅灵路爬坡路线</h1>"
                            + "<p>梅灵路从灵隐路附近的梅灵北路开始爬坡，分别经过下天竺、中天竺、上天竺，在上天竺处为坡度最高点，穿过隧道后开始下坡，分别经过梅家坞，云栖竹径等景点，到达之江路的宋城附近截止。这条坡比龙井缓，适合入门的骑友进行练习，大约10公里。</p>"
                            +"<img src=\"" + R.raw.route_4 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>西溪湿地骑行路线</h1>"
                            + "<p>骑游西溪湿地，有一长一短两条线路，分别是14.3公里的西溪环行游和2.4公里的福堤休闲游。大家可以根据体力自由选择。</p>"
                            +"<img src=\"" + R.raw.route_5a + "\"/>"
                            + "<br>"
                            +"<img src=\"" + R.raw.route_5b + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>茅家埠越野路线</h1>"
                            + "<p>山林里的快乐宝地。杭州的山地越野爱好者喜欢来此撒欢。基本在市区，交通方便。茅家埠的山地路线有多种走法，大圈可以有4-5公里，小圈可以1-2公里，上坡下坡各种地形变化多样。</p>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>钱塘江北岸绿道</h1>"
                            + "<p>从钱塘江一桥至下沙江东大桥，为钱塘江南岸的绿道，大约35公里左右。这段也是杭州“三江两岸”绿道的一部分。这一段除杭海路有两公里左右不在江边，其余的均可沿江骑行。</p>"
                            +"<img src=\"" + R.raw.route_7 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>湘湖休闲骑路线</h1>"
                            + "<p>湘湖环湖一圈大约5公里。杭州市中心来回湘湖大约40公里。萧山市中心来回湘湖大约10公里，适合新人的休闲骑路线。</p>"
                            +"<img src=\"" + R.raw.route_8 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>径山四岭水库骑行路线</h1>"
                            + "<p>径山的休闲路线，西城广场-文一西路-东西大道-科技大道-老省道-毛麻线-漕雅线，来回90公里。</p>"
                            +"<img src=\"" + R.raw.route_9 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>径山骑行路线</h1>"
                            + "<p>这条路线为进阶路线，杭州骑友里把骑过径山作为脱离新手头衔的标志，可见径山在骑友中地位之高。这里的径山是指径山寺的爬坡路线，此条爬坡路线，从径山寺山门开始算为7公里，从径山村开始到山顶则有10公里左右。从杭州市区来回大概有110公里。骑行径山特别要注意下山，一定要减速慢行。</p>"
                            +"<img src=\"" + R.raw.route_10 + "\"/>"
                            + "</body></html>",



//    };

//    public static final String[] DIALOGUE_sx = 
//        {
                    "<html><head></head><body>"
                            + "<h1>环镜湖</h1>"
                            + "<p>绍兴市区出发，走解放北路一直到梅山湿地公园附近，就可以到镜湖了。休闲骑行的好路线，环湖一圈刚好10公里左右。</p>"
                            +"<img src=\"" + R.raw.route_sx_1 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>五峰岭</h1>"
                            + "<p>从城东人民东路往东一直到樊占线到达富盛镇，在和西上线的路口直行，开始爬坡大约2公里，就是五峰岭。市区来回30公里左右。</p>"
                            +"<img src=\"" + R.raw.route_sx_2 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>嵊州天竺爬坡路线</h1>"
                            + "<p>嵊州市区骑友的爬坡路线，爬坡10公里左右，风景优美，机动车较少。</p>"
                            +"<img src=\"" + R.raw.route_sx_3 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>上虞曹娥江路线</h1>"
                            + "<p>上虞区骑友休闲骑行的好路线。沿江可以一直骑行到上浦附近，15公里左右。</p>"
                            +"<img src=\"" + R.raw.route_sx_4 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>诸暨枫谷线</h1>"
                            + "<p>从诸暨枫桥开始，一直到嵊州谷来的一条盘山公路，风景优美。特别是临近谷来的一段，基本是缓下坡，沿溪流骑行，令人心旷神怡，60公里左右。</p>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>王平线</h1>"
                            + "<p>平王线（绍兴平水镇到王坛镇）集村落、竹林、盘山公路、水库、溪流、庙宇、古树群于一身，绍兴市区来回80公里。自然景观和人文景观相当丰富，平王线穿越小舜江库区，王化溪和双江溪分别从南北两侧注入小舜江水库，著名的王化庙和舜王庙就象两颗璀璨的明珠嵌在平王线两旁。平王线穿越10个民风淳朴、热情好客的山区村落，村里百年古屋、百年古樟随处可见。</p>"
                            +"<img src=\"" + R.raw.route_sx_6 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>十赵线</h1>"
                            + "<p>平水镇--十赵线--岔路口右转--嵋山，绍兴市区来回60公里。途中的嵋山，位于平水镇横溪片，距平水镇15公里，是若耶溪的发源地。从岔路口往嵋山的公路，是一个连续5公里的大缓坡,路的尽头就是嵋山脚下,这条路路面好、风景好、竹林、水库、S形转弯、小山村一个都没有少，高山情趣是嵋山最有魅力的地方。</p>"
                            +"<img src=\"" + R.raw.route_sx_7 + "\"/>"
                            + "</body></html>",



//        };
//    
//    public static final String[] DIALOGUE_nb = 
//        {
                    "<html><head></head><body>"
                            + "<h1>横溪—白云岗—塘溪</h1>"
                            + "<p>鄞州中心区至横溪（15公里），横溪—（爬坡7.5公里）--五都头茶厂--（下坡10公里）--童村—沙村--塘溪镇—俞塘—城杨—吴徐村—五都头—横溪（共计40公里）。鄞州中心区到横街镇15公里。穿过人生鼎沸的横街镇，一进山，马上远离喧嚣。接下来的7.5公里，只有你自己呼吸喘气和变速的声音。翻过五都头坡顶的茶厂，下坡10公里到塘溪水库里面的童村，童第周的故乡哦。骑出水库，下坡到塘溪的沙村，一定要去走访一下沙氏故居。在塘溪镇上用过中饭后，经俞塘村，至城杨，往白云寺走到左侧的机耕路面后，越野500米，继续水泥爬山公路，经吴徐村到五都头。接着下坡回横溪。</p>"
                            +"<img src=\"" + R.raw.route_nb_1 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>上箭峰长坡</h1>"
                            + "<p>石碶街道—洞桥---鄞江---22公里--（龙观厂跟）---潘溪---18公里—箭峰（单程共计40公里）。上箭峰的总距离是18公里，中间下坡不算，16公里的爬坡还是有的。箭峰爬坡对新手的确是一个很大的考验，但只要你能一口气骑上去的，你骑车的体能就算过关了，之后，四明山想去哪里，就去哪里。另外有时间和闲情，箭峰下来3公里后可到观顶湖一玩。</p>"
                            +"<img src=\"" + R.raw.route_nb_2 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>东钱湖环湖路线</h1>"
                            + "<p>鄞州中心区到东钱湖大道10公里，环湖一圈32公里，来回总计52公里左右。东钱湖，宁波城区的后花园，里鄞州中心区只有10公里的路程。春暖花开，游人如织。特别是夏天夜晚，夜骑东钱湖的车友一波接一波。南宋石刻的王侯将相不在寂寥，十里四香分外喧嚣。鄞州中心区—鄞县大道—过绕城高速立交桥右拐—镇岚路—大转盘左拐—东钱湖大道—玉泉南路—到底右拐—隐学岭（爬坡200米）--启新高尔夫—韩岭（加水）--横街村—十里四香—左拐--高钱村公交车站---左拐上坡—东钱湖镇—东钱湖大道。</p>"
                            +"<img src=\"" + R.raw.route_nb_3 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>高钱---十里四香--三溪浦水库--天童</h1>"
                            + "<p>鄞州中心区至高钱村12公里，高钱至天童单趟22公里，来回44公里。共计68公里。热闹的东钱湖，喧嚣的十里四香，只要走韩天线往东，不出一公里，便来到一条安静的路上。骑到洋沙岙村，一个大左拐弯，翻过一个1.5公里的坡，下去便是三溪浦水库，经过画龙村，再爬个小坡，下去2公里便是天童古刹。高钱（动物园南门）--十里四香—左拐—韩天线—洋沙岙村—三溪浦水库—画龙—左拐上坡--天童寺。</p>"
                            +"<img src=\"" + R.raw.route_nb_4 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>上陈--芝林—上陈路线</h1>"
                            + "<p>总里程45公里一圈，加石碶—上陈18公里，来回81公里。上陈村—12.5公里—芝林—9.3公里—望石坑村，---左拐---2.7公里—孔岙---5.0公里（新水泥路，估计里程）--竹丝岚—3.8—上姚坑村—10公里---上陈。</p>"
                            +"<img src=\"" + R.raw.route_nb_5 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>四明山路线</h1>"
                            + "<p>秋高气爽，看红叶尽染，丹山赤水，峡谷纵深，四通八达，总里程135公里。石碶—15公里—鄞江—10公里---章水镇---环水库10公里---细岭—爬坡9公里—天雷坑—下坡4.2公里---茅镬大桥—右转4.6公里峡谷路段—李家坑漂流—4.5公里—四窗岩漂流—5.6公里---北溪—左拐3.7公里—四明山镇（午饭）---往梁弄大岚方向—9公里—华山村---7.0公里---大岚不到500米右拐往鹿亭，细岭方向---4.2公里右拐---细岭方向---2.0公里—分水岭村土地庙—左拐---10.3公里---细岭—20公里—鄞江---15公里---石碶。</p>"
                            +"<img src=\"" + R.raw.route_nb_6 + "\"/>"
                            + "</body></html>",

                    "<html><head></head><body>"
                            + "<h1>石碶--四明山镇--大岚--细岭--石碶</h1>"
                            + "<p>深入四明山，4月，看满山红枫，万红从中几点绿，总里程132公里。石碶—洞桥—鄞江—卢王—龙溪隧道—35公里—溪口---7.5公里—雪窦寺—8.6公里—徐凫岩—6公里---茶培—3.8公里---北溪—3.7公里--四明山镇（午饭）---往梁弄大岚方向—9公里—华山村---7.0公里---大岚不到500米右拐往鹿亭，细岭方向---4.2公里右拐---细岭方向---2.0公里—分水岭村土地庙—左拐---10.3公里---细岭—20公里—鄞江---15公里---石碶。</p>"
                            +"<img src=\"" + R.raw.route_nb_7 + "\"/>"
                            + "</body></html>",


            };
}
